## Staging: app
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**❌ &nbsp; Terraform Format:** `failed`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**🧹 &nbsp; Format:** run `terraform fmt` to fix the following: 
```sh
ecs.tf
```
```terraform
Plan: 1 to add, 14 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                  NAME                  |
|--------|----------------------------------------|
| add    | `aws_ecs_task_definition.form_viewer`  |
| update | `aws_appautoscaling_target.forms[0]`   |
|        | `aws_cloudwatch_log_group.forms`       |
|        | `aws_codedeploy_app.app`               |
|        | `aws_codedeploy_deployment_group.app`  |
|        | `aws_ecs_cluster.forms`                |
|        | `aws_ecs_service.form_viewer`          |
|        | `aws_iam_policy.cognito`               |
|        | `aws_iam_policy.forms_dynamodb`        |
|        | `aws_iam_policy.forms_kms`             |
|        | `aws_iam_policy.forms_s3`              |
|        | `aws_iam_policy.forms_secrets_manager` |
|        | `aws_iam_policy.forms_sqs`             |
|        | `aws_iam_role.codedeploy`              |
|        | `aws_iam_role.forms`                   |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # data.template_file.form_viewer_task will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "template_file" "form_viewer_task" {
      + id       = (known after apply)
      + rendered = (known after apply)
      + template = jsonencode(
            [
              + {
                  + environment      = [
                      + {
                          + name  = "METRIC_PROVIDER"
                          + value = "${metric_provider}"
                        },
                      + {
                          + name  = "TRACER_PROVIDER"
                          + value = "${tracer_provider}"
                        },
                      + {
                          + name  = "NEXTAUTH_URL"
                          + value = "${nextauth_url}"
                        },
                      + {
                          + name  = "REDIS_URL"
                          + value = "${redis_url}"
                        },
                      + {
                          + name  = "RELIABILITY_FILE_STORAGE"
                          + value = "${reliability_file_storage}"
                        },
                      + {
                          + name  = "RECAPTCHA_V3_SITE_KEY"
                          + value = "${recaptcha_public}"
                        },
                      + {
                          + name  = "TEMPORARY_TOKEN_TEMPLATE_ID"
                          + value = "${gc_temp_token_template_id}"
                        },
                      + {
                          + name  = "TEMPLATE_ID"
                          + value = "${gc_template_id}"
                        },
                      + {
                          + name  = "VAULT_FILE_STORAGE"
                          + value = "${vault_file_storage}"
                        },
                      + {
                          + name  = "COGNITO_ENDPOINT_URL"
                          + value = "${cognito_endpoint_url}"
                        },
                      + {
                          + name  = "COGNITO_CLIENT_ID"
                          + value = "${cognito_client_id}"
                        },
                      + {
                          + name  = "EMAIL_ADDRESS_CONTACT_US"
                          + value = "${email_address_contact_us}"
                        },
                      + {
                          + name  = "EMAIL_ADDRESS_SUPPORT"
                          + value = "${email_address_support}"
                        },
                      + {
                          + name  = "REPROCESS_SUBMISSION_QUEUE_URL"
                          + value = "${reprocess_submission_queue}"
                        },
                      + {
                          + name  = "AUDIT_LOG_QUEUE_URL"
                          + value = "${audit_log_queue_url}"
                        },
                    ]
                  + image            = "${image}"
                  + linuxParameters  = {
                      + capabilities = {
                          + drop = [
                              + "ALL",
                            ]
                        }
                    }
                  + logConfiguration = {
                      + logDriver = "awslogs"
                      + options   = {
                          + awslogs-group         = "${awslogs-group}"
                          + awslogs-region        = "${awslogs-region}"
                          + awslogs-stream-prefix = "${awslogs-stream-prefix}"
                        }
                    }
                  + name             = "form_viewer"
                  + portMappings     = [
                      + {
                          + containerPort = 3000
                        },
                    ]
                  + secrets          = [
                      + {
                          + name      = "NOTIFY_API_KEY"
                          + valueFrom = "${notify_api_key}"
                        },
                      + {
                          + name      = "RECAPTCHA_V3_SECRET_KEY"
                          + valueFrom = "${recaptcha_secret}"
                        },
                      + {
                          + name      = "DATABASE_URL"
                          + valueFrom = "${database_url}"
                        },
                      + {
                          + name      = "TOKEN_SECRET"
                          + valueFrom = "${token_secret}"
                        },
                      + {
                          + name      = "GC_NOTIFY_CALLBACK_BEARER_TOKEN"
                          + valueFrom = "${gc_notify_callback_bearer_token}"
                        },
                      + {
                          + name      = "FRESHDESK_API_KEY"
                          + valueFrom = "${freshdesk_api_key}"
                        },
                    ]
                },
            ]
        )
      + vars     = {
          + "audit_log_queue_url"             = "https://sqs.ca-central-1.amazonaws.com/687401027353/audit_log_queue"
          + "awslogs-group"                   = "Forms"
          + "awslogs-region"                  = "ca-central-1"
          + "awslogs-stream-prefix"           = "ecs-form-viewer"
          + "cognito_client_id"               = "17bsg3b2b7q5snon007rru264u"
          + "cognito_endpoint_url"            = "cognito-idp.ca-central-1.amazonaws.com/ca-central-1_Cguq9JNQ1"
          + "database_url"                    = "arn:aws:secretsmanager:ca-central-1:687401027353:secret:server-database-url-0PSpE3"
          + "email_address_contact_us"        = "assistance+forms-formulaires@cds-snc.ca"
          + "email_address_support"           = "assistance+forms-formulaires@cds-snc.ca"
          + "freshdesk_api_key"               = (sensitive value)
          + "gc_notify_callback_bearer_token" = (sensitive value)
          + "gc_temp_token_template_id"       = "b6885d06-d10a-422a-973f-05e274d9aa86"
          + "gc_template_id"                  = "8d597a1b-a1d6-4e3c-8421-042a2b4158b7"
          + "image"                           = "687401027353.dkr.ecr.ca-central-1.amazonaws.com/form_viewer_staging"
          + "metric_provider"                 = "stdout"
          + "nextauth_url"                    = "https://forms-staging.cdssandbox.xyz"
          + "notify_api_key"                  = (sensitive value)
          + "recaptcha_public"                = "6LfJDN4eAAAAAGvdRF7ZnQ7ciqdo1RQnQDFmh0VY"
          + "recaptcha_secret"                = (sensitive value)
          + "redis_url"                       = "gcforms-redis-rep-group.uwpetx.ng.0001.cac1.cache.amazonaws.com"
          + "reliability_file_storage"        = "forms-staging-reliability-file-storage"
          + "reprocess_submission_queue"      = "https://sqs.ca-central-1.amazonaws.com/687401027353/reprocess_submission_queue.fifo"
          + "token_secret"                    = (sensitive value)
          + "tracer_provider"                 = "stdout"
          + "vault_file_storage"              = "forms-staging-vault-file-storage"
        }
    }

  # aws_appautoscaling_target.forms[0] will be updated in-place
  ~ resource "aws_appautoscaling_target" "forms" {
        id                 = "service/arn:aws:ecs:ca-central-1:687401027353:cluster/Forms/form-viewer"
        tags               = {}
      ~ tags_all           = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
        # (6 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.forms will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "forms" {
        id                = "Forms"
        name              = "Forms"
      ~ retention_in_days = 90 -> 731
      ~ tags              = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_codedeploy_app.app will be updated in-place
  ~ resource "aws_codedeploy_app" "app" {
        id               = "0f72daa1-71c1-447c-8688-f0bce16d40d5:AppECS-Forms-form-viewer"
        name             = "AppECS-Forms-form-viewer"
      ~ tags             = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_codedeploy_deployment_group.app will be updated in-place
  ~ resource "aws_codedeploy_deployment_group" "app" {
        id                          = "65eae5e8-0f0d-46c8-8f2b-712fa56ecd0a"
      ~ tags                        = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # aws_ecs_cluster.forms will be updated in-place
  ~ resource "aws_ecs_cluster" "forms" {
        id       = "arn:aws:ecs:ca-central-1:687401027353:cluster/Forms"
        name     = "Forms"
      ~ tags     = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_ecs_service.form_viewer will be updated in-place
  ~ resource "aws_ecs_service" "form_viewer" {
        id                                 = "arn:aws:ecs:ca-central-1:687401027353:service/Forms/form-viewer"
        name                               = "form-viewer"
      ~ platform_version                   = "1.4.0" -> "LATEST"
      ~ tags                               = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.form_viewer will be created
  + resource "aws_ecs_task_definition" "form_viewer" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = "2048"
      + execution_role_arn       = "arn:aws:iam::687401027353:role/form-viewer"
      + family                   = "form-viewer"
      + id                       = (known after apply)
      + memory                   = "4096"
      + network_mode             = "awsvpc"
      + requires_compatibilities = [
          + "FARGATE",
        ]
      + revision                 = (known after apply)
      + skip_destroy             = false
      + tags_all                 = {
          + "CostCentre" = "forms-platform-staging"
          + "Terraform"  = "true"
        }
      + task_role_arn            = "arn:aws:iam::687401027353:role/form-viewer"
    }

  # aws_iam_policy.cognito will be updated in-place
  ~ resource "aws_iam_policy" "cognito" {
        id          = "arn:aws:iam::687401027353:policy/cognito"
        name        = "cognito"
      ~ tags        = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_policy.forms_dynamodb will be updated in-place
  ~ resource "aws_iam_policy" "forms_dynamodb" {
        id          = "arn:aws:iam::687401027353:policy/forms_dynamodb"
        name        = "forms_dynamodb"
      ~ tags        = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_policy.forms_kms will be updated in-place
  ~ resource "aws_iam_policy" "forms_kms" {
        id          = "arn:aws:iam::687401027353:policy/ecs_kms"
        name        = "ecs_kms"
      ~ tags        = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_policy.forms_s3 will be updated in-place
  ~ resource "aws_iam_policy" "forms_s3" {
        id        = "arn:aws:iam::687401027353:policy/formsS3Access"
        name      = "formsS3Access"
      ~ tags      = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.forms_secrets_manager will be updated in-place
  ~ resource "aws_iam_policy" "forms_secrets_manager" {
        id        = "arn:aws:iam::687401027353:policy/formsSecretsManagerKeyRetrieval"
        name      = "formsSecretsManagerKeyRetrieval"
      ~ tags      = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (5 unchanged attributes hidden)
    }

  # aws_iam_policy.forms_sqs will be updated in-place
  ~ resource "aws_iam_policy" "forms_sqs" {
        id          = "arn:aws:iam::687401027353:policy/forms_sqs"
        name        = "forms_sqs"
      ~ tags        = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (6 unchanged attributes hidden)
    }

  # aws_iam_role.codedeploy will be updated in-place
  ~ resource "aws_iam_role" "codedeploy" {
        id                    = "codedeploy"
        name                  = "codedeploy"
      ~ tags                  = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role.forms will be updated in-place
  ~ resource "aws_iam_role" "forms" {
        id                    = "form-viewer"
        name                  = "form-viewer"
      ~ tags                  = {
          - "CostCentre" = "forms-platform-staging" -> null
          - "Terraform"  = "true" -> null
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 14 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_appautoscaling_target.forms[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_codedeploy_app.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_codedeploy_deployment_group.app"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.forms"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.form_viewer"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.cognito"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_dynamodb"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_kms"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_s3"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.forms_sqs"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.codedeploy"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.forms"]

34 tests, 19 passed, 15 warnings, 0 failures, 0 exceptions

```

</details>
